--
-- 产品
--
drop   table pd_product;
create table pd_product (
 stt_date varchar(8)   not null
,end_date varchar(8)   not null
,id       varchar(16)  not null
,name     varchar(256) not null
,type     varchar(16)  not null
,id_up    varchar(16)  not null
,sno      bigint       not null
);
create unique index pd_product_pk on pd_product( stt_date, end_date, id );

comment on table  pd_product          is 'product defination';
comment on column pd_product.stt_date is 'start date';
comment on column pd_product.end_date is 'end state';
comment on column pd_product.id       is 'id';
comment on column pd_product.name     is 'name';
comment on column pd_product.type     is 'type';
comment on column pd_product.id_up    is 'up level id';
comment on column pd_product.sno      is 'sort number';

------------------------------------------------------------------------------------------------------------------------
insert into pd_product values ('20230101','29991231','1-0-00-00','资产产品',                   '1','0-0-00-00',0);
insert into pd_product values ('20230101','29991231','2-0-00-00','负债产品',                   '1','0-0-00-00',0);
insert into pd_product values ('20230101','29991231','3-0-00-00','中间业务产品',               '1','0-0-00-00',0);
------------------------------------------------------------------------------------------------------------------------
insert into pd_product values ('20230101','29991231','1-1-00-00','个人资产产品',               '2','1-0-00-00',0);
insert into pd_product values ('20230101','29991231','1-2-00-00','公司资产产品',               '2','1-0-00-00',0);
insert into pd_product values ('20230101','29991231','1-3-00-00','同业资产产品',               '2','1-0-00-00',0);

insert into pd_product values ('20230101','29991231','2-1-00-00','个人负债产品',               '2','2-0-00-00',0);
insert into pd_product values ('20230101','29991231','2-2-00-00','公司负债产品',               '2','2-0-00-00',0);
insert into pd_product values ('20230101','29991231','2-3-00-00','同业负债产品',               '2','2-0-00-00',0);

insert into pd_product values ('20230101','29991231','3-1-00-00','个人中间业务产品',           '2','3-0-00-00',0);
insert into pd_product values ('20230101','29991231','3-2-00-00','公司中间业务产品',           '2','3-0-00-00',0);
insert into pd_product values ('20230101','29991231','3-3-00-00','同业中间业务产品',           '2','3-0-00-00',0);
------------------------------------------------------------------------------------------------------------------------
------------------------------------------------------------------------------------------------------------------------
insert into pd_product values ('20230101','29991231','1-2-01-00','公司资产产品-租赁',          '3','1-2-00-00',0);
insert into pd_product values ('20230101','29991231','1-2-01-01','公司资产产品-直租',          '4','1-2-01-00',0);
insert into pd_product values ('20230101','29991231','1-2-01-02','公司资产产品-回租',          '4','1-2-01-00',0);
insert into pd_product values ('20230101','29991231','1-2-01-03','公司资产产品-经营租',        '4','1-2-01-00',0);
------------------------------------------------------------------------------------------------------------------------
insert into pd_product values ('20230101','29991231','1-2-02-00','公司资产产品-存放同业',      '3','1-2-00-00',0);
insert into pd_product values ('20230101','29991231','1-2-02-01','公司资产产品-活期存放同业',  '4','1-2-02-00',0);
insert into pd_product values ('20230101','29991231','1-2-02-02','公司资产产品-定期存放同业',  '4','1-2-02-00',0);
------------------------------------------------------------------------------------------------------------------------
insert into pd_product values ('20230101','29991231','2-3-01-00','同业负债产品-融资',          '3','2-3-00-00',0);
insert into pd_product values ('20230101','29991231','2-3-01-01','同业负债产品-拆借',          '4','2-3-01-00',0);
insert into pd_product values ('20230101','29991231','2-3-01-02','同业负债产品-活期存款',      '4','2-3-01-00',0);
insert into pd_product values ('20230101','29991231','2-3-01-03','同业负债产品-定期存款',      '4','2-3-01-00',0);
------------------------------------------------------------------------------------------------------------------------
insert into pd_product values ('20230101','29991231','2-3-02-00','同业负债产品-发债',          '3','2-3-00-00',0);
insert into pd_product values ('20230101','29991231','2-3-02-01','同业负债产品-短期债券',      '4','2-3-02-00',0);
insert into pd_product values ('20230101','29991231','2-3-02-02','同业负债产品-长期债券',      '4','2-3-02-00',0);
------------------------------------------------------------------------------------------------------------------------
insert into pd_product values ('20230101','29991231','3-2-01-00','公司中间业务产品-租赁',      '3','3-2-00-00',0);
insert into pd_product values ('20230101','29991231','3-2-01-01','公司中间业务产品-租赁租金',  '4','3-1-01-00',0);
insert into pd_product values ('20230101','29991231','3-2-01-02','公司中间业务产品-租赁手续费','4','3-1-01-00',0);
insert into pd_product values ('20230101','29991231','3-2-99-99','公司中间业务产品-其他收费',  '4','3-2-00-00',0);
------------------------------------------------------------------------------------------------------------------------
------------------------------------------------------------------------------------------------------------------------

